#+TITLE: First Programming Assignment
#+AUTHOR: Cristian Del Gobbo (pledged)
#+SUBTITLE: CSC 240 - Data Structures with C++ - Lyon College, Fall'24
#+STARTUP: overview hideblocks indent
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output

* Conditionals (Problem 7)
** Description
In this program i declared two integers a and b and initialized 
them with appropriate values. The program prints out one message 
that informs the user if a is smaller or bigger than b, or if they’re
the same.
** Code 
#+begin_src C
  int a = 1618;
  int b = 3145;

  if (a<b){
    printf("%d is smaller than %d\n", a, b);
   }else if(a>b){
    printf("%d is greater than %d\n", a, b); 
   }else{
    printf("%d and %d are the same", a, b);
   }


   #+end_src

   #+RESULTS:
   : 1618 is smaller than 3145

** Reflection
   Writing the code was fairly easy, and i didn't encounter 
   any problems. It was good as a warm up.
